#include<stdio.h>

int main(){

    int sum, p, x, y;
    sum = 0;
    for (x = 1, y = 1; x * y <=15; x++, y+=2)
    {
        p = x * y;
        sum = sum +p;
        printf("%d * %d = %d\n", x, y, p);
    }
    printf("summation of x * y = %d\n", sum);
    return 0;
}

/*
-------------------------------------| คำอธิบาย |------------------------------------
บรรทัดที่ 1 นำเข้าไลบารี stdio.h
บรรทัดที่ 3 ประกาศฟังก์ชัน main()
บรรทัดที่ 5 ประกาศตัวแปร sum, p, x, y
บรรทัดที่ 6 กำหนดค่าตัวแปร sum = 0
บรรทัดที่ 7 ใช้คำสั่ง for loop กำหนดค่าตัวแปรที่ 1 เป็น x = 1 และตัวแปรที่ 2 เป็น y = 1 กำหนดเงื่อนไข คือ 
         x*y น้อยกว่าหรือเท่ากับ 15 โดยอัปเดตค่าตัวแปร x โดยการเพิ่มค่าทีละ 1 และอัปเดตค่าตัวแปร y โดยการเพิ่มค่าทีละ 2
บรรทัดที่ 9 กำหนดให้ p = x*y
บรรทัดที่ 10 กำหนดให้ sum = sum +p
บรรทัดที่ 11 แสดงผลหน้าจอ %d * %d = %d คือแสดลผลเป็นจำนวนเต็ม และเรียกค่าจากตัวแปร x y p ตามลำดับ
บรรทัดที่ 13 แสดงผลหน้าจอ summation of x * y = %d โดยเรียกค่าจากตัวแปร sum
บรรทัดที่ 14 คืนค่าโปรแกรมเป็น 0
-------------------------------------| ค่าของโปรแกรมในแต่ละรอบของการวนซ้ำ |------------------------------------
       |   x   |   y   |   x*y(T)   |   p   |   sum
------------------------------------------------------------------------------------
รอบที่ 1 |   1   |   1   |    1(T)    |   1   |    1   
รอบที่ 2 |   2   |   3   |    6(T)    |   6   |    7   
รอบที่ 3 |   3   |   5   |    15(T)   |   15  |    22    
------------------------------------------------------------------------------------

-------------------------------------| สรุปผล |------------------------------------
    เรากำหนดค่าเริ่มต้นให้ x และ y มีค่าเท่ากับ 1 และ sum = 0 โดยให้มีการวนซ้ำตามเงื่อนไขคือ x*y น้อยกว่าหรือเท่ากับ 15
และมีกาารเพิ่มค่าตัวแปรในแต่ละรอบ โดย x เพิ่มค่าทีละ 1 y เพิ่มค่าทีละ 2 โดยมีคำสั่งในลูป คือ ให้ p มีค่าเท่ากับผลคูณของ x กับ y
และให้ sum คือผลรวม คือ นำค่า p มารวมกับค่า sum ในแต่ละรอบ แล้วแสดงผลค่าผลคูณ ซึ่งโปรแกรมจะทำการวนซ้ำจน x*y มากกว่า 15
จึงหลุดออกจากลูป แล้วจึงแสดงค่าผลรวมการคูณออกมาเป็นค่า sum
------------------------------------------------------------------------------------
*/