#include<stdio.h>
int main(){
    int i=1;

    do
    {
        printf("%d ", i);
        i++;
        if (i == 6 )
        {
            i++;
            continue;
        }
    } while ( i <= 10 );
     
    return 0;
}

/*
-------------------------------------| คำอธิบาย |------------------------------------
บรรทัดที่ 1 นำเข้าไลบารี stdio.h
บรรทัดที่ 2 ประกาศฟังก์ชัน main()
บรรทัดที่ 3 ประกาศตัวแปร i = 1
บรรทัดที่ 5 ใช้คำสั่ง do while loop คือให้ทำสั่งในอยู่ภายใน do แล้วค่อยตรวจสอบเงื่อนไขการวนลูป
บรรทัดที่ 7 แสดงผลหน้าจอเป็นค่าตัวแปร i
บรรทัดที่ 8 กำหนดให้ i เพิ่มค่าทีละ1
บรรทัดที่ 9 กำหนดคำสั่งเงื่อนไข if คือ เมื่อ i = 6
บรรทัดที่ 11 ให้เพิ่มค่า i
บรรทัดที่ 12 ข้ามไปตรวจสอบเงื่อนไข
บรรทัดที่ 14 ใช้คำสั่ง while คือกำหนดเงื่อนไขการวนซ้ำคือ i น้อยกว่าหรือเท่ากับ 10
บรรทัดที่ 16 คืนค่าโปรแกรมเป็น 0
------------------------------------------------------------------------------------
--------------------------------------------------------------| สรุปและอภิปรายผล |--------------------------------------------------------------
for + continue      | การกำหนดค่า i การตรวจสอบเงื่อนไข และการอัปเดตค่า i จะอยู่ในบรรทัดเดียวกันทำให้มีความกระชับในการเขียน
                    | โดยสร้างเงื่อนไขว่าเมื่อ i = 6 จะทำการ continue หล้งจากการเพิ่มค่า i แล้ว
----------------------------------------------------------------------------------------------------------------------------------------------
while + continue    | จะกำหนดค่า i ก่อนการใช้คำสั่ง do-while โดยโปรแกรมจะทำการแสดงค่า i แล้วเพิ่มค่า i ใน คำสั่ง do ก่อนถึง
                    | ค่อยไปตรวจสอบเงื่อนไขที่ while และด้วยลักษณะการทำงานจึงต้องสร้างคำสั่งเงื่อนไขหลังการแสดงค่าว่า เมื่อ i = 6 จะต้องสั่งให้เพิ่มค่า i แล้วข้าม
----------------------------------------------------------------------------------------------------------------------------------------------
do-while + continue | กำหนดค่า i ก่อนใช้คำสั่ง while โดยโปรแกรมจะตรวจสอบเงื่อนไขก่อนการวนลูป แล้วจึงงไปตรวจสอบคำสั่งเงื่อนไขหลังการแสดงค่าว่า
                    | เมื่อ i = 6 จะต้องสั่งให้เพิ่มค่า i แล้วข้าม ส่วนค่า i ค่าอื่นให้ทำการแสดงค่า i แล้วจึงเพิ่มค่า i 
----------------------------------------------------------------------------------------------------------------------------------------------
*/